from aiogram.dispatcher.filters import Text, Command
from aiogram.types import Message
from keyboards.default import faq
from loader import dp


@dp.message_handler(Command("faq"))
async def faq_command(message: Message):
    await message.answer("Виберіть, будь ласка, зі списку", reply_markup=faq)


@dp.message_handler(Text(equals=["Чим відрізняються Допорогові/Спрощені закупівлі від Відкритих торгів?"]))
async def btn_faq1(message: Message):
    await message.answer(FAQ1, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чим відрізняються «Допорогові закупівлі» та «Звіт про укладені договори»?"]))
async def btn_faq2(message: Message):
    await message.answer(FAQ2, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як ідентифікуватися в системі?"]))
async def btn_faq3(message: Message):
    await message.answer(FAQ3, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як поповнити рахунок (баланс компанії)?"]))
async def btn_faq4(message: Message):
    await message.answer(FAQ4, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чому платна участь для постачальників?"]))
async def btn_faq5(message: Message):
    await message.answer(FAQ5, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи може від однієї організації бути зареєстровано декілька осіб?"]))
async def btn_faq6(message: Message):
    await message.answer(FAQ6, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи маємо ми можливість навчитися оголошувати закупівлю чи брати участь у закупівлі в "
                                 "тестовому режимі?"]))
async def btn_faq7(message: Message):
    await message.answer(FAQ7, parse_mode='HTML')


@dp.message_handler(Text(equals=["Де можна знайти нормативні документи, які регулюють сферу публічних закупівель?"]))
async def btn_faq8(message: Message):
    await message.answer(FAQ8, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як знайти оголошення про закупівлю на вашому майданчику?"]))
async def btn_faq9(message: Message):
    await message.answer(FAQ9, parse_mode='HTML')


@dp.message_handler(Text(equals=["Який мінімальний крок пониження ціни, як його вирахувати та хто його визначає?"]))
async def btn_faq10(message: Message):
    await message.answer(FAQ10, parse_mode='HTML')


@dp.message_handler(Text(equals=["Що таке КЕП (Кваліфікований електронний підпис)?"]))
async def btn_faq11(message: Message):
    await message.answer(FAQ11, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи є обов\'язковим використання КЕП для державних замовників та постачальників?"]))
async def btn_faq12(message: Message):
    await message.answer(FAQ12, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як опублікувати оголошення?"]))
async def btn_faq13(message: Message):
    await message.answer(FAQ13, parse_mode='HTML')


@dp.message_handler(Text(equals=["Якого формату має бути прикріплена тендерна документація, а також пропозиції "
                                 "учасників?"]))
async def btn_faq14(message: Message):
    await message.answer(FAQ14, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи може замовник вносити зміни в оголошення та документацію? Як правильно йому це "
                                 "зробити?"]))
async def btn_faq15(message: Message):
    await message.answer(FAQ15, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як подати тендерну пропозицію на участь у закупівлі?"]))
async def btn_faq16(message: Message):
    await message.answer(FAQ16, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи може учасник редагувати/видаляти свою тендерну пропозицію?"]))
async def btn_faq17(message: Message):
    await message.answer(FAQ17, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи може учасник звернутися до Замовника із запитинням?"]))
async def btn_faq18(message: Message):
    await message.answer(FAQ18, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як замовнику розмістити відповідь на поставлене питання?"]))
async def btn_faq19(message: Message):
    await message.answer(FAQ19, parse_mode='HTML')


@dp.message_handler(Text(equals=["Якщо у закупівлі прийняв участь лише 1 постачальник, чи буде проводитися тендер?"]))
async def btn_faq20(message: Message):
    await message.answer(FAQ20, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як Замовник може відмінити закупівлю або визнати її такою, що не відбулася?"]))
async def btn_faq21(message: Message):
    await message.answer(FAQ21, parse_mode='HTML')


@dp.message_handler(Text(equals=["Як Учасника закупівлі визначити переможцем або дискваліфікувати його?"]))
async def btn_faq22(message: Message):
    await message.answer(FAQ22, parse_mode='HTML')


@dp.message_handler(Text(equals=["Що робити в тому випадку, якщо обраний Переможець відмовляється від подальшої "
                                 "співпраці?"]))
async def btn_faq23(message: Message):
    await message.answer(FAQ23, parse_mode='HTML')


@dp.message_handler(Text(equals=["Які подальші дії замовника після того, як він визнає переможця?"]))
async def btn_faq24(message: Message):
    await message.answer(FAQ24, parse_mode='HTML')


@dp.message_handler(Text(equals=["Що робити, якщо замовник отримав Вимогу про усунення порушення від одного з "
                                 "учасників на етапі кваліфікації?"]))
async def btn_faq25(message: Message):
    await message.answer(FAQ25, parse_mode='HTML')


@dp.message_handler(Text(equals=["Чи може Учасник оскаржити рішення Замовника? Які тарифи на оскарження процедури "
                                 "закупівлі?"]))
async def btn_faq26(message: Message):
    await message.answer(FAQ26, parse_mode='HTML')


FAQ1 = """
⠀⠀З відмінностями процесу проведення допорогових і спрощених закупівель і відкритих торгів Ви можете ознайомитися за <a href="https://infobox.prozorro.org/articles/doporogovi-zakupivlya-vs-vidkriti-torgi-osnovni-vidminnosti">посиланням</a>.
"""

FAQ2 = """
⠀⠀Допорогова закупівля – закупівля товарів, робіт та послуг, очікувана вартість яких менше встановленої абзацами другим і третім частини 1 статті 2 Закону України «Про публічні закупівлі».

⠀⠀Звіт про укладені договори – закупівля за прямим договором товарів, робіт та послуг, очікувана вартість яких дорівнює або перевищує 50 тис грн та є меншою за встановлену в абзацах другому і третьому частини 1 статті 2 Закону.
"""

FAQ3 = """
⠀⠀Для завершення реєстрації на електронному майданчику «<a href="www.tender-online.com.ua">ТЕНДЕР-online</a>» Вам необхідно обрати спосіб ідентифікації/авторизації:

• через підписання договору про надання послуг між Замовником/Учасником та електронним майданчиком – користувач ідентифікується після надходження майданчику підписаного паперового  оригінілу договору або  договір підписується в електронному вигляді із застосуванням КЕП.
• через отримання електронним майданчиком банківського платежу із розрахункового рахунку підприєтва – користувач ідентифікується автоматично.
"""

FAQ4 = """
⠀⠀В «Особистому кабінеті» зайдіть в розділ “Мої Фінанси” та перейдіть до вкладки “Рахунки”, далі натисніть кнопку «Створити рахунок» та вкажіть суму на яку бажаєте поповнити рахунок та натисніть кнопку «Сформувати». Для того, щоб роздрукувати рахунок натисніть відповідний «Рахунок-фактуру» в списку рахунків.
"""

FAQ5 = """
⠀⠀Систему необхідно фінансувати, вона не може функціонувати та розвиватись без фінансової підтримки. Фінансування із державного бюджету може стати важелем впливу на адміністратора системи. При цьому це все-одно буде фінансування за рахунок платників податків. Тож більш логічним і справедливим є справляння плати з безпосередніх користувачів системи, які за її допомогою можуть отримати прибуток, вигравши державні торги. При цьому для державних замовників система є та залишиться безкоштовною!
"""

FAQ6 = """
⠀⠀Так, від однієї організації може бути зареєстровано декілька уповноважених осіб. Щоб додати нового користувача потрібно зайти в «Особистий кабінет» в розділ «Моя компанія» та перейдіть до вкладки «Запрошення», натисніть кнопку «Створити запрошення», заповніть дані та натисніть «Створити». Після цього отримаєте пароль від нового облікового запису на вказаний e-mail. Кількість користувачів необмежена.
"""

FAQ7 = """
⠀⠀Так, на початку роботи Ви можете активувати тестовий режим і потренуватися оголошувати закупівлі чи подавати пропозицію.
"""

FAQ8 = """
⠀⠀У нас на сайті є сторінка «Нормативна база та роз’яснення» де можна знайти документи з корисною інформацією як для замовників, так і для учасників торгів.
"""

FAQ9 = """
⠀⠀Для того, щоб знайти закупівлю потрібно натиснути вкладку “Публічні закупівлі” та обрати відповідний розділ пошуку. Далі використовуючи запропоновані фільтри шукаєте потрібну закупівлю. Для пошуку необхідно використовувати щонайменше два фільтри.
"""

FAQ10 = """
⠀⠀Відповідно до частини другої статті 21 Закон України “Про публічні закупівлі” в оголошенні про проведення процедури відкритих торгів обов’язково зазначаються «розмір мінімального кроку пониження ціни під час електронного аукціону у відсотках або грошових одиницях та математична формула, що буде застосовуватися при проведенні електронного аукціону для визначення показників інших критеріїв оцінки». Таким чином, розмір мінімального кроку пониження ціни під час електронного аукціону встановлюється замовником самостійно.
"""

FAQ11 = """
⠀⠀Кваліфікований електронний підпис — електронний підпис, який створюється з використанням засобу кваліфікованого електронного підпису і базується на кваліфікованому сертифікаті відкритого ключа.

⠀⠀Підпис використовується юридичними та фізичними особами як аналог власноручного підпису, що надає електронному документу юридичної сили. Отримати його можна в Акредитованих центрах сертифікації ключів.
"""

FAQ12 = """
⠀⠀Так. Згідно з Законом України “Про електронні довірчі послуги” з 7 листопада 2020 року використання ЕЦП заборонено. Замість нього замовники переходять на КЕП (кваліфікований цифровий підпис).

⠀⠀Щодо використання КЕП постачальниками, звертаємо Вашу увагу що відповідно до абз. 2 п. 1 Постанови № 193 від 3 березня 2020 р до 31 грудня 2021 року приватний бізнес має право використовувати в своїй діяльності, як УЕП (удосконалений електронний підпис) так і КЕП (кваліфікаційний електроний підпис).
"""

FAQ13 = """
⠀⠀Для публікації оголошення Замовнику необхідно зайти в «Особистий кабінет» в розділ «Мої закупівлі» та перейти до вкладки «Тендери», далі натиснутиь кнопку «Створити тендер» та заповнити електронну форму оголошення, прикріпити документи і накласти ЕЦП.
"""

FAQ14 = """
⠀⠀Усі файли, що прикріплені під час оголошення Закупівлі, а також до пропозицій Учасників (якщо не вказано в тендерній документації) повинні мати розширення .doc, .docx, .ppt, .pptx, .pdf, .jpeg, .png та/або розширення програм, що здійснюють архівацію даних. Забороняється обмежувати перегляд цих файлів шляхом встановлення на них паролів або у будь-який інший спосіб. Забороняється додавати документи, що безпосередньо не стосуються Закупівлі.
"""

FAQ15 = """
⠀⠀Відповідно до п. 2 статті 23 Закон України “Про публічні закупівлі” Замовник має право вносити зміни до тендерної документації. У разі внесення змін до тендерної документації строк для подання тендерних пропозицій продовжується в електронній системі закупівель таким чином, щоб з моменту внесення змін до тендерної документації до закінчення строку подання тендерних пропозицій залишалося не менше ніж сім днів. Для того, щоб внести зміни в оголонення та тендерну документацію, необхідно обрати закупівлю, потім натиснуту «Редагувати оголошення» та натиснути «Зберегти та перейти до публікації». Уся історія змін документів, внесених у цей період, зберігається і доступна для перегляду користувачам Системи.

⠀⠀Замовник разом із змінами до тендерної документації в окремому документі оприлюднює перелік змін, що вносяться. Положення тендерної документації, до яких вносяться зміни, відображаються у вигляді закреслених даних та повинні бути доступними для перегляду після внесення змін до тендерної документації.
"""

FAQ16 = """
⠀⠀Для того, щоб подати тендерну пропозицію необхідно обрати цікаву для вас закупівлю, яка знаходиться в статусі очікування пропозиції, детально ознайомитись із оголошенням або тендерною документацією. Зібрати відповідний перелік документів (який обов’язково зазначеий в документації), сформувати на майданчику рахунок (плата відповідно до постанови Кабміну), оплатити його,  та завантажити відповідні документи.
"""

FAQ17 = """
⠀⠀Відповідно до пункту 5 статті 25 Закон України “Про публічні закупівлі” Учасник має право вносити зміни та уточнення до поданої ним тендерної пропозиції до закінчення періоду подання пропозицій, визначених замовником. Уся історія змін, внесених у цей період, зберігається і стає доступною для перегляду всім користувачам Системи після закінчення аукціону. Учасник може анулювати свою пропозицію лише в період прийому тендерних пропозицій.
"""

FAQ18 = """
⠀⠀Відповідно до пункту 1 статті 23 Закон України “Про публічні закупівлі” Фізична/юридична особа має право не пізніше ніж за 10 днів до закінчення строку подання тендерної пропозиції звернутися через електронну систему закупівель до замовника за роз’ясненнями щодо тендерної документації та/або звернутися до замовника з вимогою щодо усунення порушення під час проведення процедури закупівлі. Усі звернення за роз’ясненнями та звернення щодо усунення порушення автоматично оприлюднюються в електронній системі закупівель без ідентифікації особи, яка звернулася до замовника. Замовник повинен протягом трьох робочих днів з дня їх оприлюднення надати роз’яснення на звернення та оприлюднити його на веб-порталі Уповноваженого органу відповідно до статті 10 Закону України «Про публічні закупівлі».

⠀⠀Для того, щоб розмістити запитання по закупівлі необхідно обрати оголошення, яке перебуває в статусі період уточнень та скористатися функцією «Запитання та відповіді». Потім відкриється вікно, в якому необхідно заповнити веб-форму та підтвердити «Подати запитання».
"""

FAQ19 = """
⠀⠀Для того, щоб розмістити відповідь на питання, що надійшло від Учасника Замовник обирає відповідну закупівлю, переходить до вкладки «Запитання та відповіді», заповнює відповідне поле та натискає «Надати відповідь».
"""

FAQ20 = """
⠀⠀У допорогових та спрощених закупівлях система автоматично переходить в статус “Кваліфікація”. Далі Замовник визначає Учасника переможцем або дискваліфікує його.

⠀⠀У дадпорогових закупівлях в такій ситуації закупівля вважається такою, що не відбулася. Для проведення процедури закупівлі має бути подано не менше двох тендерних пропозицій. Ця норма визначена пунктом 1 статті 31 Закон України “Про публічні закупівлі”.
"""

FAQ21 = """
⠀⠀Для відміни закупівлі необхідно обрати відповідну закупівлю на сторінці профіля Замовника та натиснути «Скасувати тендер/лот», потім потрібно вказати причину та тип скасування процедури закупівлі. Після цього необхідно завантажити документ із обґрунтуванням відміни закупівлі та натиснути «Скасувати».
"""

FAQ22 = """
⠀⠀На етапі кваліфікація Замовник торгів має змогу обрати переможця тендеру. Для цього потрібно перейти на закупівлю, натиснути посилання “Кваліфікація”. У вікні, що з’явилося, обрати потрібний пункт: визнати переможцем або дискваліфікувати, далі потрібно зазначити обгрунтування та додати документ, що містить відповідне рішення.
"""

FAQ23 = """
⠀⠀Відповідно до статті 30 Закон України “Про публічні закупівлі” Замовник відхиляє тендерну пропозицію в разі якщо переможець відмовився від підписання договору про закупівлю відповідно до вимог тендерної документації або укладення договору про закупівлю.
"""

FAQ24 = """
⠀⠀Якщо тендерна пропозиція учасника відповідає умовам тендерної документації, замовник визначає такого учасника переможцем та публікує в Системі скан-копію документа з відповідним рішенням, після чого підписує договір та оприлюднює його.
"""

FAQ25 = """
⠀⠀Згідно з пунктом 3 статті 30 Закон України “Про публічні закупівлі” «У разі якщо учасник, тендерна пропозиція якого відхилена, вважає недостатньою аргументацію, зазначену в повідомленні, такий учасник може повторно звернутися до замовника з вимогою надати додаткову інформацію стосовно причини невідповідності його пропозиції умовам тендерної документації, зокрема, технічній специфікації та/або його невідповідності кваліфікаційним критеріям, а замовник зобов’язаний надати йому відповідь з такою інформацією не пізніше ніж через п’ять днів з дня надходження такого звернення через електронну систему закупівель.».
"""

FAQ26 = """
⠀⠀Учасники закупівель можуть подавати скарги у трьох випадках:

• на умови тендерної документації;
• при неправомірній дискваліфікації або на рішення про визначення переможця закупівлі;
• на рішення замовника скасувати закупівлю.

⠀⠀Кабмін затвердив постанову в якій встановлено диференційований розмір плати за подання скарги — в залежності від очікуваної вартості закупівлі, з обмеженим мінімальним та максимальним розмірами.

• у разі оскарження умов тендерної документації, вартість скарги дорівнюватиме 0,3% від очікуваної вартості закупівлі, при цьому мінімальна вартість становитиме 2 тис. грн, а максимальна — 85 тис. грн.
• у разі оскарження рішень замовника вартість скарги дорівнюватиме 0,6% від очікуваної вартості закупівлі, при цьому мінімальна вартість скарги становитиме 3 тис. грн, а максимальна — 170 тис. грн.
⠀⠀Плата за подання скарги в АМКУ проводиться через електронну систему закупівель, в день її подання. І тільки після цього скарга автоматично вноситься до реєстру скарг. Якщо вашу скаргу задовольнили, частково задовольнили, або не розглянули, бо замовник уже усунув порушення — вам повернуться кошти в повному обсязі. ДП “Прозорро” перерахує їх вам упродовж двох днів після оприлюднення рішення АМКУ в системі.
"""
