from aiogram.dispatcher.filters import Text, Command
from aiogram.types import Message
from keyboards.default import partners
from loader import dp


@dp.message_handler(Command("partners"))
async def partners_command(message: Message):
    await message.answer("Виберіть, будь ласка, зі списку", reply_markup=partners)


@dp.message_handler(Text(equals=["⚖️ Правова підтримка"]))
async def btn_partners1(message: Message):
    await message.answer(LOW_HELP, parse_mode='HTML')


@dp.message_handler(Text(equals=["📈 Аналітика ринку"]))
async def btn_partners2(message: Message):
    await message.answer(ANALYTICS_HELP, parse_mode='HTML')

LOW_HELP = """
⠀<b>⚖️ Правова підтримка та супровід участі у тендері:</b>

• підготовка тендерної пропозиції відповідно до вимог тендерної документації;
• підготовка документів переможця.


⠀<b>Правова підтримка та супровід оскарження закупівлі:</b>

• написання вимог для усунення замовником дискримінаційних порушень;
• оскарження умов тендерної документації;
• оскарження рішень замовника (відхилення, визнання переможцем);
• представництво в Антимонопольному комітеті.


⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, на кожному етапі будуть поряд і завжди на зв’язку.
"""

ANALYTICS_HELP = """
⠀<b>📈 Послуга аналітики ринку</b>

⠀⠀Коли Ви відкриваєте для себе новий ринок збуту, логічно, що першочергово слід його проаналізувати. Ми пропонуємо для Вас послугу, яка може стати незамінною.
⠀⠀
⠀⠀Що саме можна проаналізувати?

⠀⠀Все залежить від поставлених задач.

⠀⠀Якщо Ви тільки починаєте приймати участь у державних закупівлях, можна проаналізувати:

• конкурентність ніші в державних закупівлях;
• конкурентність ніші в конкретних регіонах;
• основного конкурента, його первинної та остаточної пропозиції;
• конкретні оголошення для визначення перспектив участі у закупівлі.

⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, на кожному етапі будуть поряд і завжди на зв’язку.
"""
