from aiogram.dispatcher.filters import Text, Command
from aiogram.types import Message
from keyboards.default import partners
from loader import dp, _


@dp.message_handler(Command("partners"))
async def partners_command(message: Message):
    await message.answer(_("Оберіть, будь ласка, зі списку ⬇️"), reply_markup=partners)


@dp.message_handler(Text(equals=[_("⚖️ Правова підтримка")]))
async def btn_partners1(message: Message):
    await message.answer(
        _("⠀<b>⚖️ Послуги правової підтримки</b>\n\n"
          "⠀<b>Супровід участі у тендері:</b>\n\n"
          "⠀• підготовка тендерної пропозиції відповідно до вимог тендерної документації;\n"
          "⠀• підготовка документів переможця.\n\n\n"
          "⠀<b>Супровід оскарження закупівлі:</b>\n\n"
          "⠀• написання вимог для усунення замовником дискримінаційних порушень;\n"
          "⠀• оскарження умов тендерної документації;\n"
          "⠀• оскарження рішень замовника (відхилення, визнання переможцем);\n"
          "⠀• представництво в Антимонопольному комітеті.\n\n\n"
          "⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, "
          "на кожному етапі будуть поряд і завжди на зв’язку."),
        parse_mode='HTML'
    )


@dp.message_handler(Text(equals=[_("📈 Аналітика ринку")]))
async def btn_partners2(message: Message):
    await message.answer(
        _("⠀<b>📈 Послуга аналітики ринку</b>\n\n"
          "⠀⠀Коли Ви відкриваєте для себе новий ринок збуту, логічно, що першочергово слід його проаналізувати."
          " Ми пропонуємо для Вас послугу, яка може стати незамінною.\n\n"
          "⠀⠀Що саме можна проаналізувати?\n\n"
          "⠀⠀Все залежить від поставлених задач.\n\n"
          "⠀⠀Якщо Ви тільки починаєте приймати участь у державних закупівлях, можна проаналізувати:\n\n"
          "⠀• конкурентність ніші в державних закупівлях;\n"
          "⠀• конкурентність ніші в конкретних регіонах;\n"
          "⠀• основного конкурента, його первинної та остаточної пропозиції;\n"
          "⠀• конкретні оголошення для визначення перспектив участі у закупівлі.\n\n"
          "⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, "
          "на кожному етапі будуть поряд і завжди на зв’язку.\n"),
        parse_mode='HTML'
    )

