from aiogram.dispatcher.filters import Text, Command
from aiogram.types import Message
from keyboards.default import tariff
from loader import dp


@dp.message_handler(Command("tariff"))
async def partners_command(message: Message):
    await message.answer("Виберіть, будь ласка, зі списку", reply_markup=tariff)


@dp.message_handler(Text(equals=["🔵 Prozorro"]))
async def btn_tariff1(message: Message):
    await message.answer(TARIFF_PROZORRO, parse_mode='HTML')


@dp.message_handler(Text(equals=["🟢 Prozorro Market"]))
async def btn_tariff2(message: Message):
    await message.answer(TARIFF_PROZORRO_MARKET, parse_mode='HTML')


TARIFF_PROZORRO = """
<b>💰 ТАРИФНА ПОЛІТИКА/TARIFF POLICY</b>

⠀⠀За подання Учасником тендерної пропозиції, що була розкрита електронною системою закупівель, згідно із Постановою Кабміну номер 166 справляється регламентована плата у розмірі:

• у разі, коли вартість закупівлі становить не більш як <b>20 тисяч гривень</b> — один неоподатковуваний мінімум доходів громадян (<b>17 грн.</b>);
• у разі, коли вартість закупівлі становить не більш як <b>50 тисяч гривень</b> — сім неоподатковуваних мінімумів доходів громадян (<b>119 грн.</b>);
• у разі, коли вартість закупівлі становить не більш як <b>200 тисяч гривень</b> — двадцять неоподатковуваних мінімумів доходів громадян (<b>340 грн.</b>);
• у разі, коли вартість закупівлі становить не більш як <b>1 млн. гривень</b> — тридцять неоподатковуваних мінімумів доходів громадян (<b>510 грн.</b>);
• у разі, коли вартість закупівлі становить більш як <b>1 млн. гривень</b> — сто неоподатковуваних мінімумів доходів громадян (<b>1700 грн.</b>);
• у разі, коли вартість закупівлі становить більш як <b>4 млн. гривень</b> — двісті неоподатковуваних мінімумів доходів громадян (<b>3400 грн.</b>)
"""

TARIFF_PROZORRO_MARKET = """
<b>💰 ТАРИФНА ПОЛІТИКА/TARIFF POLICY</b>

⠀⠀З  переможця  відбору  в  електронному  каталозі  Prozorro  Market,  з  яким  замовник уклав договір про закупівлю стягується плата за доступ до онлайн-сервісу у розмірі. Дані тарифи встановлені постановою Кабінету Міністрів № 822.

• <b>3%</b> (відсотка) суми договору про закупівлю, якщо вартість закупівлі становить <b>не більше, як 50 тис гривень</b>;
• <b>2%</b> (відсотка) суми договору про закупівлю, якщо вартість закупівлі становить <b>не більше, як 200 тис. гривень</b>;
• <b>1%</b> (відсоток) суми договору про закупівлю, якщо вартість закупівлі становить <b>більше 200 тис. гривень</b>.
"""
