tariff_prozorro = """
<b>💰 ТАРИФНА ПОЛІТИКА/TARIFF POLICY</b>

⠀⠀За подання Учасником тендерної пропозиції, що була розкрита електронною системою закупівель, згідно із Постановою Кабміну номер 166 справляється регламентована плата у розмірі:

— у разі, коли вартість закупівлі становить не більш як <b>20 тисяч гривень</b> — один неоподатковуваний мінімум доходів громадян (<b>17 грн.</b>);
— у разі, коли вартість закупівлі становить не більш як <b>50 тисяч гривень</b> — сім неоподатковуваних мінімумів доходів громадян (<b>119 грн.</b>);
— у разі, коли вартість закупівлі становить не більш як <b>200 тисяч гривень</b> — двадцять неоподатковуваних мінімумів доходів громадян (<b>340 грн.</b>);
— у разі, коли вартість закупівлі становить не більш як <b>1 млн. гривень</b> — тридцять неоподатковуваних мінімумів доходів громадян (<b>510 грн.</b>);
— у разі, коли вартість закупівлі становить більш як <b>1 млн. гривень</b> — сто неоподатковуваних мінімумів доходів громадян (<b>1700 грн.</b>);
— у разі, коли вартість закупівлі становить більш як <b>4 млн. гривень</b> — двісті неоподатковуваних мінімумів доходів громадян (<b>3400 грн.</b>)
"""

tariff_prozorro_market = """
<b>💰 ТАРИФНА ПОЛІТИКА/TARIFF POLICY</b>

⠀⠀З  переможця  відбору  в  електронному  каталозі  Prozorro  Market,  з  яким  замовник уклав договір про закупівлю стягується плата за доступ до онлайн-сервісу у розмірі. Дані тарифи встановлені постановою Кабінету Міністрів № 822.

— <b>3%</b> (відсотка) суми договору про закупівлю, якщо вартість закупівлі становить <b>не більше, як 50 тис гривень</b>;
— <b>2%</b> (відсотка) суми договору про закупівлю, якщо вартість закупівлі становить <b>не більше, як 200 тис. гривень</b>;
— <b>1%</b> (відсоток) суми договору про закупівлю, якщо вартість закупівлі становить <b>більше 200 тис. гривень</b>.
"""

about_prozorro = """
<a href=\"https://prozorro.gov.ua/about\">🔵 Про Prozorro</a>

⠀⠀⠀⠀<b>Prozorro</b> — електронна система публічних закупівель, де державні та комунальні замовники оголошують тендери на закупівлю товарів, робіт і послуг, а представники бізнесу змагаються на торгах за можливість стати постачальником держави.
⠀⠀⠀⠀Сфера публічних закупівель регулюється Законом України «Про публічні закупівлі», а головним нормотворчим органом у цій сфері є Департамент сфери публічних закупівель, який входить до складу Міністерства розвитку економіки, торгівлі та сільського господарства України
⠀⠀⠀⠀З 1 квітня 2016 року система Prozorro є обов’язковою для центральних органів влади та монополістів, а з 1 серпня — для всіх інших державних замовників
⠀⠀⠀⠀На <b>Prozorro</b> неможливо зареєструватися, адже це центральна база даних, яка приймає інформацію від усіх майданчиків, і одночасно синхронізує її між собою. Реєстрація можлива лише на акредитованому майданчику, який належить до бізнесових структур. Таким чином відсікається монополія державного підприємства над даними у державних закупівлях.

⠀⠀⠀⠀<b>ТЕНДЕР-online</b> - це акредитований майданчик системи закупівель <b>Prozorro</b>, який має всі 5 рівнів акредитації, а також перший онлайн магазин для державних замовників - <b>Prozorro Market</b>.
"""

low_help = """
⠀<b>⚖️ Правова підтримка та супровід участі у тендері:</b>

— підготовка тендерної пропозиції відповідно до вимог тендерної документації;
— підготовка документів переможця.


⠀<b>Правова підтримка та супровід оскарження закупівлі:</b>

— написання вимог для усунення замовником дискримінаційних порушень;
— оскарження умов тендерної документації;
— оскарження рішень замовника (відхилення, визнання переможцем);
— представництво в Антимонопольному комітеті.


⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, на кожному етапі будуть поряд і завжди на зв’язку.
"""

analytics_help = """
⠀<b>📈 Послуга аналітики ринку</b>

⠀⠀Коли Ви відкриваєте для себе новий ринок збуту, логічно, що першочергово слід його проаналізувати. Ми пропонуємо для Вас послугу, яка може стати незамінною.
⠀⠀
⠀⠀Що саме можна проаналізувати?

⠀⠀Все залежить від поставлених задач.

⠀⠀Якщо Ви тільки починаєте приймати участь у державних закупівлях, можна проаналізувати:

— конкурентність ніші в державних закупівлях;
— конкурентність ніші в конкретних регіонах;
— основного конкурента, його первинної та остаточної пропозиції;
— конкретні оголошення для визначення перспектив участі у закупівлі.

⠀⠀Наші партнери із задоволенням подбають про повний цикл Вашої участі у закупівлі, на кожному етапі будуть поряд і завжди на зв’язку.
"""

chef_answer = """
<b>⭐ Шановний клієнте!</b>

Якщо Вам потрібно зв’язатись з керівником майданчика ТЕНДЕР-online, напишіть повідомлення @CEO_TENDER_online

Ми завжди вдячні за зворотній зв’язок.
"""


btnFAQ1_text = """
⠀⠀З відмінностями процесу проведення допорогових і спрощених закупівель і відкритих торгів Ви можете ознайомитися за <a href="https://infobox.prozorro.org/articles/doporogovi-zakupivlya-vs-vidkriti-torgi-osnovni-vidminnosti">посиланням</a>.
"""

btnFAQ2_text = """
⠀⠀Допорогова закупівля – закупівля товарів, робіт та послуг, очікувана вартість яких менше встановленої абзацами другим і третім частини 1 статті 2 Закону України «Про публічні закупівлі».

⠀⠀Звіт про укладені договори – закупівля за прямим договором товарів, робіт та послуг, очікувана вартість яких дорівнює або перевищує 50 тис грн та є меншою за встановлену в абзацах другому і третьому частини 1 статті 2 Закону.
"""

btnFAQ3_text = """
⠀⠀Для завершення реєстрації на електронному майданчику «<a href="www.tender-online.com.ua">ТЕНДЕР-online</a>» Вам необхідно обрати спосіб ідентифікації/авторизації:

— через підписання договору про надання послуг між Замовником/Учасником та електронним майданчиком – користувач ідентифікується після надходження майданчику підписаного паперового  оригінілу договору або  договір підписується в електронному вигляді із застосуванням КЕП.
— через отримання електронним майданчиком банківського платежу із розрахункового рахунку підприєтва – користувач ідентифікується автоматично.
"""

btnFAQ4_text = """
⠀⠀В «Особистому кабінеті» зайдіть в розділ “Мої Фінанси” та перейдіть до вкладки “Рахунки”, далі натисніть кнопку «Створити рахунок» та вкажіть суму на яку бажаєте поповнити рахунок та натисніть кнопку «Сформувати». Для того, щоб роздрукувати рахунок натисніть відповідний «Рахунок-фактуру» в списку рахунків.
"""

btnFAQ5_text = """
⠀⠀Систему необхідно фінансувати, вона не може функціонувати та розвиватись без фінансової підтримки. Фінансування із державного бюджету може стати важелем впливу на адміністратора системи. При цьому це все-одно буде фінансування за рахунок платників податків. Тож більш логічним і справедливим є справляння плати з безпосередніх користувачів системи, які за її допомогою можуть отримати прибуток, вигравши державні торги. При цьому для державних замовників система є та залишиться безкоштовною!
"""

btnFAQ6_text = """
⠀⠀Так, від однієї організації може бути зареєстровано декілька уповноважених осіб. Щоб додати нового користувача потрібно зайти в «Особистий кабінет» в розділ «Моя компанія» та перейдіть до вкладки «Запрошення», натисніть кнопку «Створити запрошення», заповніть дані та натисніть «Створити». Після цього отримаєте пароль від нового облікового запису на вказаний e-mail. Кількість користувачів необмежена.
"""

btnFAQ7_text = """
⠀⠀Так, на початку роботи Ви можете активувати тестовий режим і потренуватися оголошувати закупівлі чи подавати пропозицію.
"""

btnFAQ8_text = """
⠀⠀У нас на сайті є сторінка «Нормативна база та роз’яснення» де можна знайти документи з корисною інформацією як для замовників, так і для учасників торгів.
"""

btnFAQ9_text = """
⠀⠀Для того, щоб знайти закупівлю потрібно натиснути вкладку “Публічні закупівлі” та обрати відповідний розділ пошуку. Далі використовуючи запропоновані фільтри шукаєте потрібну закупівлю. Для пошуку необхідно використовувати щонайменше два фільтри.
"""

btnFAQ10_text = """
⠀⠀Відповідно до частини другої статті 21 Закон України “Про публічні закупівлі” в оголошенні про проведення процедури відкритих торгів обов’язково зазначаються «розмір мінімального кроку пониження ціни під час електронного аукціону у відсотках або грошових одиницях та математична формула, що буде застосовуватися при проведенні електронного аукціону для визначення показників інших критеріїв оцінки». Таким чином, розмір мінімального кроку пониження ціни під час електронного аукціону встановлюється замовником самостійно.
"""

btnFAQ11_text = """
⠀⠀Кваліфікований електронний підпис — електронний підпис, який створюється з використанням засобу кваліфікованого електронного підпису і базується на кваліфікованому сертифікаті відкритого ключа.

⠀⠀Підпис використовується юридичними та фізичними особами як аналог власноручного підпису, що надає електронному документу юридичної сили. Отримати його можна в Акредитованих центрах сертифікації ключів.
"""

btnFAQ12_text = """
⠀⠀Так. Згідно з Законом України “Про електронні довірчі послуги” з 7 листопада 2020 року використання ЕЦП заборонено. Замість нього замовники переходять на КЕП (кваліфікований цифровий підпис).

⠀⠀Щодо використання КЕП постачальниками, звертаємо Вашу увагу що відповідно до абз. 2 п. 1 Постанови № 193 від 3 березня 2020 р до 31 грудня 2021 року приватний бізнес має право використовувати в своїй діяльності, як УЕП (удосконалений електронний підпис) так і КЕП (кваліфікаційний електроний підпис).
"""

btnFAQ13_text = """
⠀⠀Для публікації оголошення Замовнику необхідно зайти в «Особистий кабінет» в розділ «Мої закупівлі» та перейти до вкладки «Тендери», далі натиснутиь кнопку «Створити тендер» та заповнити електронну форму оголошення, прикріпити документи і накласти ЕЦП.
"""

btnFAQ14_text = """
⠀⠀Усі файли, що прикріплені під час оголошення Закупівлі, а також до пропозицій Учасників (якщо не вказано в тендерній документації) повинні мати розширення .doc, .docx, .ppt, .pptx, .pdf, .jpeg, .png та/або розширення програм, що здійснюють архівацію даних. Забороняється обмежувати перегляд цих файлів шляхом встановлення на них паролів або у будь-який інший спосіб. Забороняється додавати документи, що безпосередньо не стосуються Закупівлі.
"""

btnFAQ15_text = """
⠀⠀Відповідно до п. 2 статті 23 Закон України “Про публічні закупівлі” Замовник має право вносити зміни до тендерної документації. У разі внесення змін до тендерної документації строк для подання тендерних пропозицій продовжується в електронній системі закупівель таким чином, щоб з моменту внесення змін до тендерної документації до закінчення строку подання тендерних пропозицій залишалося не менше ніж сім днів. Для того, щоб внести зміни в оголонення та тендерну документацію, необхідно обрати закупівлю, потім натиснуту «Редагувати оголошення» та натиснути «Зберегти та перейти до публікації». Уся історія змін документів, внесених у цей період, зберігається і доступна для перегляду користувачам Системи.

⠀⠀Замовник разом із змінами до тендерної документації в окремому документі оприлюднює перелік змін, що вносяться. Положення тендерної документації, до яких вносяться зміни, відображаються у вигляді закреслених даних та повинні бути доступними для перегляду після внесення змін до тендерної документації.
"""

btnFAQ16_text = """
⠀⠀Для того, щоб подати тендерну пропозицію необхідно обрати цікаву для вас закупівлю, яка знаходиться в статусі очікування пропозиції, детально ознайомитись із оголошенням або тендерною документацією. Зібрати відповідний перелік документів (який обов’язково зазначеий в документації), сформувати на майданчику рахунок (плата відповідно до постанови Кабміну), оплатити його,  та завантажити відповідні документи.
"""

btnFAQ17_text = """
⠀⠀Відповідно до пункту 5 статті 25 Закон України “Про публічні закупівлі” Учасник має право вносити зміни та уточнення до поданої ним тендерної пропозиції до закінчення періоду подання пропозицій, визначених замовником. Уся історія змін, внесених у цей період, зберігається і стає доступною для перегляду всім користувачам Системи після закінчення аукціону. Учасник може анулювати свою пропозицію лише в період прийому тендерних пропозицій.
"""

btnFAQ18_text = """
⠀⠀Відповідно до пункту 1 статті 23 Закон України “Про публічні закупівлі” Фізична/юридична особа має право не пізніше ніж за 10 днів до закінчення строку подання тендерної пропозиції звернутися через електронну систему закупівель до замовника за роз’ясненнями щодо тендерної документації та/або звернутися до замовника з вимогою щодо усунення порушення під час проведення процедури закупівлі. Усі звернення за роз’ясненнями та звернення щодо усунення порушення автоматично оприлюднюються в електронній системі закупівель без ідентифікації особи, яка звернулася до замовника. Замовник повинен протягом трьох робочих днів з дня їх оприлюднення надати роз’яснення на звернення та оприлюднити його на веб-порталі Уповноваженого органу відповідно до статті 10 Закону України «Про публічні закупівлі».

⠀⠀Для того, щоб розмістити запитання по закупівлі необхідно обрати оголошення, яке перебуває в статусі період уточнень та скористатися функцією «Запитання та відповіді». Потім відкриється вікно, в якому необхідно заповнити веб-форму та підтвердити «Подати запитання».
"""

btnFAQ19_text = """
⠀⠀Для того, щоб розмістити відповідь на питання, що надійшло від Учасника Замовник обирає відповідну закупівлю, переходить до вкладки «Запитання та відповіді», заповнює відповідне поле та натискає «Надати відповідь».
"""

btnFAQ20_text = """
⠀⠀У допорогових та спрощених закупівлях система автоматично переходить в статус “Кваліфікація”. Далі Замовник визначає Учасника переможцем або дискваліфікує його.

⠀⠀У дадпорогових закупівлях в такій ситуації закупівля вважається такою, що не відбулася. Для проведення процедури закупівлі має бути подано не менше двох тендерних пропозицій. Ця норма визначена пунктом 1 статті 31 Закон України “Про публічні закупівлі”.
"""

btnFAQ21_text = """
⠀⠀Для відміни закупівлі необхідно обрати відповідну закупівлю на сторінці профіля Замовника та натиснути «Скасувати тендер/лот», потім потрібно вказати причину та тип скасування процедури закупівлі. Після цього необхідно завантажити документ із обґрунтуванням відміни закупівлі та натиснути «Скасувати».
"""

btnFAQ22_text = """
⠀⠀На етапі кваліфікація Замовник торгів має змогу обрати переможця тендеру. Для цього потрібно перейти на закупівлю, натиснути посилання “Кваліфікація”. У вікні, що з’явилося, обрати потрібний пункт: визнати переможцем або дискваліфікувати, далі потрібно зазначити обгрунтування та додати документ, що містить відповідне рішення.
"""

btnFAQ23_text = """
⠀⠀Відповідно до статті 30 Закон України “Про публічні закупівлі” Замовник відхиляє тендерну пропозицію в разі якщо переможець відмовився від підписання договору про закупівлю відповідно до вимог тендерної документації або укладення договору про закупівлю.
"""

btnFAQ24_text = """
⠀⠀Якщо тендерна пропозиція учасника відповідає умовам тендерної документації, замовник визначає такого учасника переможцем та публікує в Системі скан-копію документа з відповідним рішенням, після чого підписує договір та оприлюднює його.
"""

btnFAQ25_text = """
⠀⠀Згідно з пунктом 3 статті 30 Закон України “Про публічні закупівлі” «У разі якщо учасник, тендерна пропозиція якого відхилена, вважає недостатньою аргументацію, зазначену в повідомленні, такий учасник може повторно звернутися до замовника з вимогою надати додаткову інформацію стосовно причини невідповідності його пропозиції умовам тендерної документації, зокрема, технічній специфікації та/або його невідповідності кваліфікаційним критеріям, а замовник зобов’язаний надати йому відповідь з такою інформацією не пізніше ніж через п’ять днів з дня надходження такого звернення через електронну систему закупівель.».
"""

btnFAQ26_text = """
⠀⠀Учасники закупівель можуть подавати скарги у трьох випадках:

— на умови тендерної документації;
— при неправомірній дискваліфікації або на рішення про визначення переможця закупівлі;
— на рішення замовника скасувати закупівлю.

⠀⠀Кабмін затвердив постанову в якій встановлено диференційований розмір плати за подання скарги — в залежності від очікуваної вартості закупівлі, з обмеженим мінімальним та максимальним розмірами.

— у разі оскарження умов тендерної документації, вартість скарги дорівнюватиме 0,3% від очікуваної вартості закупівлі, при цьому мінімальна вартість становитиме 2 тис. грн, а максимальна — 85 тис. грн.
— у разі оскарження рішень замовника вартість скарги дорівнюватиме 0,6% від очікуваної вартості закупівлі, при цьому мінімальна вартість скарги становитиме 3 тис. грн, а максимальна — 170 тис. грн.
⠀⠀Плата за подання скарги в АМКУ проводиться через електронну систему закупівель, в день її подання. І тільки після цього скарга автоматично вноситься до реєстру скарг. Якщо вашу скаргу задовольнили, частково задовольнили, або не розглянули, бо замовник уже усунув порушення — вам повернуться кошти в повному обсязі. ДП “Прозорро” перерахує їх вам упродовж двох днів після оприлюднення рішення АМКУ в системі.
"""
