from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

faq = ReplyKeyboardMarkup(
    keyboard=[
        [
            KeyboardButton(text="🔙 Головне меню")
        ],
        [
            KeyboardButton(text="Чим відрізняються Допорогові/Спрощені закупівлі від Відкритих торгів?")
        ],
        [
            KeyboardButton(text="Чим відрізняються «Допорогові закупівлі» та «Звіт про укладені договори»?")
        ],
        [
            KeyboardButton(text="Як ідентифікуватися в системі?")
        ],
        [
            KeyboardButton(text="Як поповнити рахунок (баланс компанії)?")
        ],
        [
            KeyboardButton(text="Чому платна участь для постачальників?")
        ],
        [
            KeyboardButton(text="Чи може від однієї організації бути зареєстровано декілька осіб?")
        ],
        [
            KeyboardButton(text="Чи маємо ми можливість навчитися оголошувати закупівлю чи брати участь у закупівлі в "
                                "тестовому режимі?")
        ],
        [
            KeyboardButton(text="Де можна знайти нормативні документи, які регулюють сферу публічних закупівель?")
        ],
        [
            KeyboardButton(text="Як знайти оголошення про закупівлю на вашому майданчику?")
        ],
        [
            KeyboardButton(text="Який мінімальний крок пониження ціни, як його вирахувати та хто його визначає?")
        ],
        [
            KeyboardButton(text="Що таке КЕП (Кваліфікований електронний підпис)?")
        ],
        [
            KeyboardButton(text="Чи є обов\'язковим використання КЕП для державних замовників та постачальників?")
        ],
        [
            KeyboardButton(text="Як опублікувати оголошення?")
        ],
        [
            KeyboardButton(text="Якого формату має бути прикріплена тендерна документація, а також пропозиції "
                                "учасників?")
        ],
        [
            KeyboardButton(text="Чи може замовник вносити зміни в оголошення та документацію? Як правильно йому це "
                                "зробити?")
        ],
        [
            KeyboardButton(text="Як подати тендерну пропозицію на участь у закупівлі?")
        ],
        [
            KeyboardButton(text="Чи може учасник редагувати/видаляти свою тендерну пропозицію?")
        ],
        [
            KeyboardButton(text="Чи може учасник звернутися до Замовника із запитинням?")
        ],
        [
            KeyboardButton(text="Як замовнику розмістити відповідь на поставлене питання?")
        ],
        [
            KeyboardButton(text="Якщо у закупівлі прийняв участь лише 1 постачальник, чи буде проводитися тендер?")
        ],
        [
            KeyboardButton(text="Як Замовник може відмінити закупівлю або визнати її такою, що не відбулася?")
        ],
        [
            KeyboardButton(text="Як Учасника закупівлі визначити переможцем або дискваліфікувати його?")
        ],
        [
            KeyboardButton(text="Що робити в тому випадку, якщо обраний Переможець відмовляється від подальшої "
                                "співпраці?")
        ],
        [
            KeyboardButton(text="Які подальші дії замовника після того, як він визнає переможця?")
        ],
        [
            KeyboardButton(text="Що робити, якщо замовник отримав Вимогу про усунення порушення від одного з "
                                "учасників на етапі кваліфікації?")
        ],
        [
            KeyboardButton(text="Чи може Учасник оскаржити рішення Замовника? Які тарифи на оскарження процедури "
                                "закупівлі?")
        ],
    ],
    resize_keyboard=True
)
